app/views/file_records/show.html.erb

SELECT  "steps".* FROM "steps"  WHERE "steps"."file_record_id" = ?  ORDER BY "steps"."id" DESC LIMIT 1  [["file_record_id", 1]]
---

    <% @file_record.steps.each do |step| %>

SELECT "offices".* FROM "offices"
---
<%= form_for [@file_record, @step] do |f| %>
<%= f.collection_select(:step, :office_id, Office.all, :id, :name) %>