app/controllers/file_records_controller.rb

SELECT "file_records".* FROM "file_records"  WHERE (title like '%ley%')
---
  def index
    @file_records = FileRecord.all

INSERT INTO "file_records" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-03 18:48:04.558492"], ["title", "Decreto 1215"], ["updated_at", "2014-07-03 18:48:04.558492"]]
---
  def create
    @file_record = FileRecord.new(file_record_params)

    respond_to do |format|
      if @file_record.save

UPDATE "file_records" SET "title" = ?, "updated_at" = ? WHERE "file_records"."id" = 6  [["title", "sjdahsauiohdusahdhsaDAS sdhuashdas"], ["updated_at", "2014-07-03 18:49:33.021468"]]
---
  def update
    respond_to do |format|
      if @file_record.update(file_record_params)

DELETE FROM "file_records" WHERE "file_records"."id" = ?  [["id", 6]]
---
  def destroy
    @file_record.destroy

SELECT  "file_records".* FROM "file_records"  WHERE "file_records"."id" = ? LIMIT 1  [["id", 6]]
---
    def set_file_record
      @file_record = FileRecord.find(params[:id])