app/controllers/offices_controller.rb

  def index
    @offices = Office.all
---
SELECT "offices".* FROM "offices"

  def create
    @office = Office.new(office_params)

    respond_to do |format|
      if @office.save
---
INSERT INTO "offices" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-03 18:31:01.856119"], ["name", "Mesa de entrada"], ["updated_at", "2014-07-03 18:31:01.856119"]]

  def update
    respond_to do |format|
      if @office.update(office_params)
---
UPDATE "offices" SET "name" = ?, "updated_at" = ? WHERE "offices"."id" = 3  [["name", "Leyes y Decretos que bolacera"], ["updated_at", "2014-07-03 18:32:28.641882"]]

  def destroy
    @office.destroy
---
DELETE FROM "offices" WHERE "offices"."id" = ?  [["id", 3]]

    def set_office
      @office = Office.find(params[:id])
---
SELECT  "offices".* FROM "offices"  WHERE "offices"."id" = ? LIMIT 1  [["id", 3]]