app/controllers/steps_controller.rb

  def index
    @steps = Step.all
---
SELECT "steps".* FROM "steps"

  def create
    @step = Step.new(step_params)

    respond_to do |format|
      if @step.save
---
INSERT INTO "steps" ("created_at", "file_record_id", "office_id", "person_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-03 18:50:51.827503"], ["file_record_id", 3], ["office_id", 1], ["person_id", 2], ["updated_at", "2014-07-03 18:50:51.827503"]]

  def update
    respond_to do |format|
      if @step.update(step_params)
---
UPDATE "steps" SET "office_id" = ?, "person_id" = ?, "updated_at" = ? WHERE "steps"."id" = 4  [["office_id", 5], ["person_id", 4], ["updated_at", "2014-07-03 19:39:51.507824"]]

  def destroy
    @step.destroy
---
DELETE FROM "steps" WHERE "steps"."id" = ?  [["id", 4]]

    def set_step
      @step = Step.find(params[:id])
---
SELECT  "steps".* FROM "steps"  WHERE "steps"."id" = ? LIMIT 1  [["id", 4]]